back/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(uid: session[:user_uid])