back/app/controllers/api/v1/sixhats_controller.rb

      def index
        @sixhats = Sixhat.all
---
SELECT "sixhats".* FROM "sixhats"