back/app/controllers/api/v1/sixhats_controller.rb

  def index
    if current_user
      @sixhats = Sixhat.where(uid: current_user.uid)
---
SELECT "sixhats".* FROM "sixhats" WHERE "sixhats"."uid" = $1  [["uid", "102099541158899868378.0"]]

  def create
    if current_user
      @sixhat = Sixhat.new(sixhat_params.merge(uid: current_user.uid))
      if @sixhat.save
---
INSERT INTO "sixhats" ("uid", "theme", "red", "white", "black", "green", "yellow", "blue", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    authorize_sixhat
    if @sixhat.update(sixhat_params)
---
UPDATE "sixhats" SET "theme" = $1, "updated_at" = $2 WHERE "sixhats"."id" = $3  [["theme", "いいい"], ["updated_at", "2024-09-12 06:33:30.699279"], ["id", 2]]

  def destroy
    authorize_sixhat
    @sixhat.destroy
---
DELETE FROM "sixhats" WHERE "sixhats"."id" = $1  [["id", 2]]

  def set_sixhat
    @sixhat = Sixhat.find(params[:id])
---
SELECT "sixhats".* FROM "sixhats" WHERE "sixhats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]