back/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("uid", "provider", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "uid"
SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 AND "users"."name" = $3 AND "users"."email" = $4 LIMIT $5  [["provider", "google"], ["uid", "112227920694984963764.0"], ["name", "sy I (サイン)"], ["email", "syonosuke0616@gmail.com"], ["LIMIT", 1]]
---
      def create
        # 引数の条件に該当するデータがあればそれを返す。なければ新規作成する
        user = User.find_or_create_by(provider: params[:provider], uid: params[:uid], name: params[:name], email: params[:email])